100000 IDENTIFICATION DIVISION.
100010 PROGRAM-ID. HELLO.
200000 ENVIRONMENT DIVISION.
210000 INPUT-OUTPUT SECTION.
211000 FILE-CONTROL.
211011 SELECT F-INPUT ASSIGN TO '/code/input.txt'
211012 ORGANIZATION IS SEQUENTIAL.
300000 DATA DIVISION.
310000 FILE SECTION.
310010 FD F-INPUT.
310011 01 F-DATA PIC 9.
320000 WORKING-STORAGE SECTION.
320010 01 WS-BUF PIC 9.
320020 01 WS-EOF PIC A.
320030 01 WS-POINTER.
320031 05 WS-START-PTR PIC 9(5).
320034 05 WS-END-PTR PIC 9(5).
320035 05 WS-END-INDEX PIC 9(5).
320036 05 WS-END-CNT PIC 9.
320037 05 WS-OUT-PTR PIC 9(9).
320038 05 WS-EMPTY-CNT PIC 9.
320040 01 WS-DATA.
320041 05 WS-ITEM PIC 9 OCCURS 20000 TIMES.
320042 05 WS-LOST PIC 9 OCCURS 20000 TIMES.
320050 01 WS-RESULT PIC 9(20).
320060 01 WS-TEMP PIC 9(9).
320060 01 WS-TODO PIC 9.
300000 PROCEDURE DIVISION.
300010* READ FILE DATA
300011 OPEN INPUT F-INPUT.
300012 PERFORM UNTIL WS-EOF='Y'
300013 READ F-INPUT INTO WS-BUF
300014 AT END MOVE 'Y' TO WS-EOF
300015 NOT AT END ADD 1 TO WS-END-PTR
300016 MOVE WS-BUF TO WS-ITEM(WS-END-PTR)
300017 END-READ
300018 END-PERFORM.
300019 CLOSE F-INPUT.
300020 SUBTRACT 1 FROM WS-END-PTR.
300021 DIVIDE WS-END-PTR BY 2 GIVING WS-END-INDEX.
300049* LOOP
300050 PERFORM UNTIL WS-END-PTR <= 1
300051 MOVE WS-ITEM(WS-END-PTR) TO WS-END-CNT
300052 MOVE 0 TO WS-OUT-PTR
300053 MOVE 1 TO WS-START-PTR
300054 MOVE 1 TO WS-TODO
300060 PERFORM UNTIL WS-START-PTR >= WS-END-PTR OR WS-TODO = 0
300061 ADD WS-ITEM(WS-START-PTR) WS-LOST(WS-START-PTR) TO WS-OUT-PTR
300062 SUBTRACT WS-ITEM(WS-START-PTR + 1) FROM WS-LOST(WS-START-PTR)
300063-GIVING WS-EMPTY-CNT
300070 IF (WS-EMPTY-CNT >= WS-END-CNT) THEN
300071 PERFORM WS-END-CNT TIMES
300072 MULTIPLY WS-END-INDEX BY WS-OUT-PTR GIVING WS-TEMP
300073 ADD WS-TEMP TO WS-RESULT
300074 ADD 1 TO WS-OUT-PTR
300075 END-PERFORM
300076 ADD WS-END-CNT TO WS-LOST(WS-START-PTR)
300077 MOVE 0 TO WS-TODO
300078 ADD WS-EMPTY-CNT TO WS-OUT-PTR
300079 SUBTRACT WS-END-CNT FROM WS-OUT-PTR
300080 ELSE
300081 ADD WS-EMPTY-CNT TO WS-OUT-PTR
300082 END-IF
300083 ADD 2 TO WS-START-PTR
300089 END-PERFORM
300090 IF WS-TODO = 1 THEN
300091 PERFORM WS-END-CNT TIMES
300092 MULTIPLY WS-END-INDEX BY WS-OUT-PTR GIVING WS-TEMP
300093 ADD WS-TEMP TO WS-RESULT
300094 ADD 1 TO WS-OUT-PTR
300099 END-PERFORM
300100 END-IF
300101 SUBTRACT 1 FROM WS-END-INDEX
300102 SUBTRACT 2 FROM WS-END-PTR
300109 END-PERFORM
300999 DISPLAY WS-RESULT
301000 STOP RUN.
