100000 IDENTIFICATION DIVISION.
100010 PROGRAM-ID. HELLO.
200000 ENVIRONMENT DIVISION.
210000 INPUT-OUTPUT SECTION.
211000 FILE-CONTROL.
211011 SELECT F-INPUT ASSIGN TO '/code/input.txt'
211012 ORGANIZATION IS SEQUENTIAL.
300000 DATA DIVISION.
310000 FILE SECTION.
310010 FD F-INPUT.
310011 01 F-DATA PIC 9(1).
320000 WORKING-STORAGE SECTION.
320010 01 WS-BUF PIC 9(1).
320020 01 WS-EOF PIC A(1).
320030 01 WS-POINTER.
320031 05 WS-START-PTR PIC 9(5) VALUE 1.
320032 05 WS-START-INDEX PIC 9(5).
320033 05 WS-START-CNT PIC 9(1).
320034 05 WS-END-PTR PIC 9(5).
320035 05 WS-END-INDEX PIC 9(5).
320036 05 WS-END-CNT PIC 9(1).
320037 05 WS-OUT-PTR PIC 9(9).
320038 05 WS-EMPTY-CNT PIC 9(1).
320040 01 WS-DATA.
320041 05 WS-ITEM PIC 9(1) OCCURS 20000 TIMES.
320050 01 WS-RESULT PIC 9(20).
320060 01 WS-TEMP PIC 9(9).
300000 PROCEDURE DIVISION.
300010* READ FILE DATA
300011 OPEN INPUT F-INPUT.
300012 PERFORM UNTIL WS-EOF='Y'
300013 READ F-INPUT INTO WS-BUF
300014 AT END MOVE 'Y' TO WS-EOF
300015 NOT AT END ADD 1 TO WS-END-PTR
300016 MOVE WS-BUF TO WS-ITEM(WS-END-PTR)
300017 END-READ
300018 END-PERFORM.
300019 CLOSE F-INPUT.
300040 SUBTRACT 1 FROM WS-END-PTR.
300041 DIVIDE WS-END-PTR BY 2 GIVING WS-END-INDEX.
300042 ADD 1 TO WS-END-INDEX.
300043 DISPLAY WS-END-INDEX " " WS-END-PTR
300049* LOOP
300050 PERFORM UNTIL WS-START-PTR > WS-END-PTR
300051 MOVE WS-ITEM(WS-START-PTR) TO WS-START-CNT
300052 PERFORM UNTIL WS-START-CNT = 0
300053 MULTIPLY WS-START-INDEX BY WS-OUT-PTR GIVING WS-TEMP
300054 ADD WS-TEMP TO WS-RESULT
300055 SUBTRACT 1 FROM WS-START-CNT
300056 ADD 1 TO WS-OUT-PTR
300057 END-PERFORM
300060 ADD 1 TO WS-START-PTR
300061 MOVE WS-ITEM(WS-START-PTR) TO WS-EMPTY-CNT
300070 PERFORM UNTIL WS-EMPTY-CNT = 0 OR WS-END-PTR <= WS-START-PTR
300080 IF WS-END-CNT = 0
300081 MOVE WS-ITEM(WS-END-PTR) TO WS-END-CNT
300082 SUBTRACT 2 FROM WS-END-PTR
300083 SUBTRACT 1 FROM WS-END-INDEX
300084 END-IF
300090 PERFORM UNTIL WS-END-CNT = 0 OR WS-EMPTY-CNT = 0
300091 MULTIPLY WS-END-INDEX BY WS-OUT-PTR GIVING WS-TEMP
300092 ADD WS-TEMP TO WS-RESULT
300093 SUBTRACT 1 FROM WS-END-CNT
300094 SUBTRACT 1 FROM WS-EMPTY-CNT
300095 ADD 1 TO WS-OUT-PTR
300096 END-PERFORM
300100 END-PERFORM
300110 ADD 1 TO WS-START-PTR
300111 ADD 1 TO WS-START-INDEX
300120 END-PERFORM
300130 PERFORM UNTIL WS-END-CNT = 0
300131 MULTIPLY WS-END-INDEX BY WS-OUT-PTR GIVING WS-TEMP
300132 ADD WS-TEMP TO WS-RESULT
300133 SUBTRACT 1 FROM WS-END-CNT
300134 ADD 1 TO WS-OUT-PTR
300135 END-PERFORM
300999 DISPLAY WS-RESULT
301000 STOP RUN.
